In [5]:
import pandas as pd

In [19]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head(5)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [21]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [23]:
df['col2'].nunique()

3

In [29]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [31]:
newdf = df[(df['col1']>2)& (df['col2']==444)]

In [33]:
newdf

   col1  col2 col3
3     4   444  xyz

In [37]:
def times2(x):
    return x*2

In [39]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [41]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [43]:
df['col1'].sum()

10

In [45]:
del df['col1']

In [47]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [49]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [51]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [53]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [55]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi